import { useEffect, useState } from "react";
import { toast } from "react-toastify";
import {
  User,
  Phone,
  Mail,
  MapPin,
  UserCheck,
  Lock,
  KeyRound,
  MessageCircleMore,
  Calendar,
} from "lucide-react";
import dayjs from "dayjs";

import "./Register.css"; // Import the CSS file
import "./Verification.css"; // Import the CSS file
import { useNavigate } from "react-router-dom";
import BookingCalendar from "./BookingCalendar";

const Register = () => {
  const [formData, setFormData] = useState({
    name: "",
    phone: "",
    email: "",
    district: "",
    region: "",
    role: "",
    password: "",
    contact: "",
  });
  const [loading, setLoading] = useState(false);
  const [registered, setRegistered] = useState(false);
  const [regions, setRegions] = useState([]);

  //booking calendar
  // Add these states to your Register component
  const [showBookingModal, setShowBookingModal] = useState(false);
  const [bookingDate, setBookingDate] = useState(null);
  const [bookingTime, setBookingTime] = useState(null);
  //const userTimezone =
  //Intl.DateTimeFormat().resolvedOptions().timezone || "Asia/Beirut";
  const navigate = useNavigate();
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);
  //way of contact
  const contacts = [
    "عبر البريد الالكتروني",
    "التواصل عبر الواتساب",
    "اتصال هاتفي",
  ];
  // Dropdown options
  const roles = [
    "مرشح/ة  لمجلس البلدية",
    "مرشح/ة  مختار",
    "مدير/ة  حملة إنتخابية",
    "ناشط/ة  سياسي/ة محلي/ة",
  ];

  const districts = [
    "بيروت ",
    "قضاء جبيل",
    "قضاء كسروان",
    "قضاء المتن",
    "قضاء بعبدا",
    "قضاء عاليه",
    "قضاء الشوف",
    "قضاء الهرمل",
    "قضاء بعلبك",
    "قضاء زحلة",
    "قضاء البقاع الغربي",
    "قضاء راشيا",
    "قضاء عكار",
    "قضاء طرابلس",
    "قضاء زغرتا",
    "قضاء بشري",
    "قضاء البترون",
    "قضاء الكورة",
    "قضاء المنية-الضنية",
    "قضاء صيدا",
    "قضاء صور",
    "قضاء جزين",
    "قضاء النبطية",
    "قضاء حاصبيا",
    "قضاء مرجعيون",
    "قضاء بنت جبيل",
  ];

  // District to regions mapping object
  const districtRegionsMap = {
    "قضاء جبيل": [
      "اده",
      "ادونيس وسنور",
      "افقا",
      "البرباره",
      "الجليسة",
      "الحصون",
      "الخاربة",
      "الراموط",
      "الريحانه",
      "العاقورة",
      "الغابات",
      "الفيدار",
      "القطاره",
      "الكفر",
      "اللقلوق",
      "المجدل",
      "المزاريب",
      "المغيري",
      "المنصف",
      "اهمج",
      "بجه",
      "بحديدات",
      "بخعاز",
      "بزيون",
      "بشتليدا وفدار",
      "بشللي",
      "بلاط",
      "بنتاعل",
      "بيت حباق",
      "ترتج",
      "جاج",
      "جبيل",
      "جدايل",
      "جنه ومار سركيس",
      "حاقل",
      "حالات",
      "حبالين",
      "حجولا",
      "حصارات",
      "حصرايل",
      "دملصا",
      "راس اسطا",
      "زبدين",
      "ساقية الخيط",
      "سرعيتا",
      "سقي رشميا",
      "شامات",
      "شموت",
      "شيخان",
      "طورزيا",
      "عبيدات",
      "علمات/ج",
      "علمات/ش",
      "عمشيت",
      "عنايا وكفربعال",
      "عين الدلبه",
      "عين الشلال",
      "عين الصوانة",
      "عين الغويبه",
      "عين جرين",
      "عين كفاع",
      "غرزوز",
      "غرفين",
      "غلبون",
      "فتري",
      "فدار",
      "فرات",
      "فرحت",
      "فغال",
      "قرطبا",
      "قرقريا",
      "قهمز",
      "كفركده",
      "كفرمسحون",
      "كفون",
      "لاسا",
      "لحفد",
      "مزرعة السياد",
      "مشان",
      "مشمش",
      "معاد",
      "ميفوق",
      "نهر ابراهيم",
      "هابيل",
      "يانوح",
    ],
    "بيروت ": ["بيروت "],
    "قضاء كسروان": [
      "ادما الدفنه",
      "اغبه",
      "البوار",
      "الحصين",
      "الزعيتره",
      "الصفرا",
      "العبره وشوان",
      "العذرا",
      "العقيبه",
      "الغينه",
      "القليعات",
      "الكفور",
      "المراديه",
      "المعيصره",
      "النمورة و كفرجريف",
      "بزحل",
      "بزمار",
      "بطحا",
      "بقعاتة عشقوت",
      "بقعاتة كنعان",
      "بقعتوته",
      "بلونه",
      "جديدة غزير",
      "جعيتا",
      "جورة الترمس",
      "جورة بدران",
      "حارة صخر",
      "حراجل",
      "حريصا",
      "حياطا",
      "داريا",
      "درعون",
      "دلبتا",
      "رعشين",
      "ريفون",
      "زوق مصبح",
      "زوق مكايل",
      "زيتون",
      "ساحل علما",
      "سهيله",
      "شحتول",
      "شننعير",
      "صربا",
      "طبرجا",
      "عجلتون",
      "عرامون",
      "عشقوت",
      "عين الدلبه",
      "عين الريحانه",
      "عينطوره",
      "غادير",
      "غباله",
      "غدراس",
      "غزير",
      "غوسطا",
      "فاريا",
      "فتقا",
      "فيطرون",
      "كفرتيه",
      "كفردبيان",
      "كفرياسين",
      "معراب",
      "ميروبا",
      "نهر الذهب",
      "هرهريا والقطين",
      "وطى الجوز",
      "يحشوش",
    ],

    "قضاء المتن": [
      "ابو ميزان",
      "البوشرية",
      "الجديدة",
      "الجوار",
      "الخله",
      "الخنشارة",
      "الدكوانه",
      "الدوار",
      "الديشونية",
      "الرابية",
      "الزغرين",
      "الزلقا",
      "السفيلة",
      "الشاويه والقنيطره",
      "الشوير",
      "الضبيه",
      "العطشانة",
      "العيرون",
      "العيون",
      "الغابة",
      "الفريكه",
      "الفنار",
      "القعقور",
      "المتين",
      "المجذوب و مزهر",
      "المحيدثة",
      "المروج",
      "المسقى",
      "المشرع",
      "المطيلب",
      "المكلس",
      "المنصورية",
      "المياسة",
      "النقاش",
      "انطلياس",
      "بتغرين",
      "بحرصاف",
      "برج حمود",
      "برمانا",
      "بسكنتا",
      "بصاليم",
      "بعبدات",
      "بقنايا",
      "بكفيا",
      "بياقوت",
      "بيت الشعار",
      "بيت الككو",
      "بيت شباب",
      "بيت مري",
      "جل الديب",
      "جورة البلوط",
      "حملايا",
      "دير شمرا",
      "ديك المحدي",
      "ذوق الخراب",
      "روميه",
      "زبوغا",
      "زرعون",
      "زكريت",
      "ساقية المسك",
      "سد البوشرية",
      "سن الفيل",
      "شرين",
      "شويا",
      "ضهر الصوان",
      "عمارة شلهوب",
      "عوكر",
      "عين التفاحة",
      "عين الخروبة",
      "عين الزيتونة",
      "عين السنديانة",
      "عين الصفصاف",
      "عين القبو",
      "عين سعاده",
      "عين عار",
      "عين علق",
      "عينطورة",
      "قرنة الحمرا",
      "قرنة شهوان",
      "قنابة برمانا",
      "قنابة صليما",
      "كفرتيه",
      "كفرعقاب",
      "مار بطرس كرم التين",
      "مار شعيا والمزكه",
      "مار مخايل بنابيل",
      "مار موسى الدوار",
      "مجدل ترشيش",
      "مرجبا",
      "مزرعة بنابيل",
      "مزرعة يشوع",
      "مشيخا",
      "نابيه",
      "وادي الكرم",
      "وادي شاهين",
      "وطى المروج",
    ],

    "قضاء بعبدا": [
      "ارصون",
      "الحازمية",
      "الحدث",
      "الخريبه",
      "الدليبه",
      "الشبانية",
      "الشياح",
      "العبادية",
      "العربانية",
      "الغبيري",
      "القرية",
      "القصيبة",
      "القلعة",
      "الكحلونية",
      "الكنيسه",
      "اللويزه",
      "الليلكي",
      "المرداشة",
      "المريجة",
      "الهلالية",
      "بتبيات",
      "بتخنيه",
      "برج البراجنة",
      "بزبدين",
      "بسابا",
      "بطشيه",
      "بعبدا",
      "بعلشميه",
      "بمريم",
      "تحويطة الغدير",
      "تحويطة النهر",
      "ترشيش",
      "جوار الحوز",
      "جورة ارصون",
      "حارة البطم",
      "حارة الست",
      "حارة حريك",
      "حارة حمزة",
      "حاصبيا",
      "حمانا",
      "حي الفياضية",
      "خلوات فالوغا",
      "دير الحرف",
      "دير خونه وتلتيته",
      "راس الحرف",
      "راس المتن",
      "رويسة البلوط",
      "زندوقة",
      "سبنيه",
      "شويت",
      "صليما",
      "عاريا",
      "عين الرمانة",
      "عين موفق",
      "فالوغا",
      "قبيع",
      "قتاله",
      "قرطاضه",
      "قرنايل",
      "كفرسلوان",
      "كفرشيما",
      "وادي شحرور السفلى",
      "وادي شحرور العليا",
    ],

    "قضاء عاليه": [
      "اغميد",
      "البساتين",
      "البنيه",
      "التعزانيه",
      "الرجمة",
      "الرملية",
      "الشويفات",
      "العزونيه",
      "الغابون",
      "القماطيه",
      "الكحاله",
      "المريجات",
      "المشرفه",
      "المنصورية",
      "بتاتر",
      "بحمدون",
      "بحواره",
      "بخشتيه",
      "بدادون",
      "بدغان",
      "بسرين",
      "بسوس",
      "بشامون",
      "بطلون",
      "بعورته",
      "بليبل",
      "بمكين",
      "بمهريه",
      "بو زريده",
      "بيصور",
      "جسر القاضي",
      "حبرمون",
      "حومال",
      "دفون",
      "دقون",
      "دوير الرمان",
      "دير قوبل",
      "رشميا",
      "رمحالا",
      "رويسة النعمان",
      "سرحمول",
      "سلفايا",
      "سوق الغرب",
      "شارون",
      "شانيه",
      "شرتون",
      "شملان",
      "صوفر",
      "عاليه",
      "عبيه",
      "عرمون",
      "عيتات",
      "عين الجديدة",
      "عين الحلزون",
      "عين الرمانة",
      "عين السيدة",
      "عين الفرديس",
      "عين المرج",
      "عين تراز",
      "عين داره",
      "عين درافيل",
      "عين عنوب",
      "عين كسور",
      "عيناب",
      "كفرعميه",
      "كفرمتى",
      "كيفون",
      "مجدلبعنا",
      "مجدليا",
      "محطة بحمدون",
      "مزرعة النهر",
      "معصريتي",
    ],

    "قضاء الشوف": [
      "الباروك",
      "البرجين",
      "البطال",
      "البيره",
      "الجاهلية",
      "الجليلية",
      "الجميلية",
      "الجيه",
      "الخريبة",
      "الدامور",
      "الدبيه",
      "الرميله",
      "الزعرورية",
      "السمقانية",
      "الفريديس",
      "الفوارة",
      "الكحلونيه",
      "الكنيسة",
      "المحتقرة ودير المخلص",
      "المختارة",
      "المشرف",
      "المطلة",
      "المعنيه",
      "المغيرية",
      "الناعمة",
      "الوردانية",
      "الورهانية",
      "باتر",
      "بتلون",
      "برجا",
      "بريح",
      "بسابا",
      "بشتفين",
      "بطمة",
      "بعاصير",
      "بعذران",
      "بعقلين",
      "بقعاتا",
      "بكيفا",
      "بنويتي",
      "بيت الدين",
      "بيقون",
      "جباع",
      "جدرا - وادي الزينة",
      "جديده الشوف",
      "جون",
      "حارة الناعمة",
      "حارة بعاصير",
      "حارة جندل",
      "حصروت",
      "خربة بسري",
      "داريا",
      "دلهون",
      "دميت",
      "دير القمر",
      "دير بابا",
      "دير دوريت",
      "دير كوشه",
      "سبلين",
      "سرجبال",
      "شحيم",
      "شوريت",
      "ضهر المغارة",
      "عانوت",
      "عترين",
      "علمان والبرغوتية",
      "عماطور",
      "عميق",
      "عين الاسد الشميس",
      "عين الحور",
      "عين زحلتا",
      "عين قني",
      "عين وزين",
      "عينبال",
      "غريفة",
      "كترمايا",
      "كفرحي",
      "كفرحيم",
      "كفرفاقود",
      "كفرقطرة",
      "كفرنبرخ",
      "كفرنيس",
      "كليليه",
      "مجد المعوش",
      "مجدلونا",
      "مرج برجا",
      "مرستي",
      "مزبود",
      "مزرعة الشوف",
      "مزرعة الضهر",
      "مزمورة",
      "معاصر الشوف",
      "معاصر بيت الدين",
      "نيحا",
      "وادي الدير",
      "وادي الست",
      "وادي بنحلية",
      "وادي دير دوريت",
    ],

    "قضاء الهرمل": [
      "البستان",
      "البويضة",
      "الحريقة",
      "الحميري",
      "الخرايب",
      "الزويتيني",
      "السويسة",
      "الشربين",
      "الشواغير",
      "القرينة",
      "القصر",
      "الكواخ",
      "المعاصر",
      "المعيصرة",
      "الهرمل",
      "بريصا",
      "جوار الحشيش",
      "حوش السيد علي",
      "زغرين",
      "سهلات الماء",
      "فيسان",
      "قنافذ",
      "مراح العين",
      "مزرعة بيت الطشم",
      "مزرعة بيت الفقيه",
      "مزرعة سجد",
      "وادي التركمان",
      "وادي الرطل",
      "وادي العس",
      "وادي الكرم",
      "وادي النيرة",
      "وادي بنيت",
    ],

    "قضاء بعلبك": [
      "الانصار",
      "البرانية حي المسيحيين",
      "التوفيقيه",
      "الجبانيه",
      "الجديدة",
      "الحدث",
      "الحلانية",
      "الخريبة",
      "الخضر",
      "الرام",
      "الريش الشرقي",
      "الريش الغربي",
      "الريش حي الشميس",
      "الزرازير",
      "السعيده",
      "السفري",
      "الصوانية",
      "الطيبة",
      "العقيدية",
      "العلاق",
      "العين",
      "الفاكهه",
      "القاع",
      "القدام",
      "الكنيسه",
      "اللبوه",
      "النبي رشاده",
      "النبي سباط",
      "النبي شيت",
      "النبي عثمان",
      "النبي نعام",
      "النقره",
      "اليمونه",
      "ايعات",
      "بتدعي",
      "بدنايل",
      "برقا",
      "بريتال",
      "بشوات",
      "بوداي",
      "بيت شاما",
      "بيت صليبي",
      "بيت مشيك",
      "تمنين التحتا",
      "تمنين الفوقا",
      "جبعا",
      "جبوله",
      "جنتا",
      "حام",
      "حربتا",
      "حزين",
      "حلبتا",
      "حور تعلا",
      "حوش الذهب",
      "حوش الرافقة",
      "حوش النبي",
      "حوش بردى",
      "حوش تل صفية",
      "حوش سنيد",
      "حي الست",
      "حي الصلح",
      "حي العباسيه",
      "دار الواسعة",
      "دورس",
      "دير الاحمر",
      "راس بعلبك",
      "رماسا",
      "ريحا",
      "زبود",
      "سرعين التحتا",
      "سرعين الفوقا",
      "شعث",
      "شليفا",
      "شمسطار",
      "صبوبا",
      "صفرا",
      "طاريا",
      "طفيل",
      "طليا",
      "عرسال",
      "عين السوداء",
      "عين بورضاي",
      "عيناتا",
      "غفره",
      "فلاوي",
      "قبة دورس",
      "قرحا",
      "قصرنبا",
      "قلد السبع",
      "قلعه",
      "قلعه غربي",
      "كفردان",
      "كفردبش",
      "مجدلون",
      "محلة المسيحيين",
      "مزرعة آل سويدان",
      "مزرعة ابو صليبي",
      "مزرعة التوت",
      "مزرعة السيد",
      "مزرعة الضليل",
      "مزرعة بيت مطر",
      "مصنع الزهره",
      "معربون",
      "مقراق",
      "مقنه",
      "نبحا",
      "نحله",
      "وادي الزين",
      "وادي الصفا الشرقي",
      "وادي المشمشه",
      "وادي فعرة",
      "يحفوفا",
      "يونين",
    ],

    "قضاء زحلة": [
      "ابلح",
      "التويتة",
      "الدلهمية",
      "الفرزل",
      "الكرمه",
      "المريجات",
      "الناصرية",
      "النبي ايلا",
      "الوقف",
      "بتياس",
      "بر الياس",
      "بوارج",
      "تربل",
      "تعلبايا",
      "تعنايل",
      "تل الاخضر",
      "جديتا",
      "جلالا",
      "حاجي جبيلي",
      "حزرتا",
      "حوش الغنم",
      "حوش حالا",
      "حي السلم",
      "حي الفيكاني",
      "خضربك",
      "دير الغزال",
      "رعيت",
      "رياق",
      "زحلة",
      "سعدنايل",
      "شتوره",
      "علي النهري",
      "عين كفرزبد",
      "قاع الريم",
      "قب الياس",
      "قوسايا",
      "كابوسية",
      "كفرزبد",
      "ماسا",
      "مجدل عنجر",
      "مكسة",
      "نيحا",
      "وادي الدلم",
      "يوغون اولوك",
    ],

    "قضاء البقاع الغربي": [
      "الخياره",
      "الدكوة",
      "الروضه",
      "السلطان يعقوب التحتا",
      "السلطان يعقوب الفوقا",
      "الشبرقية",
      "الصويري",
      "القرعون",
      "المرج",
      "المناره",
      "المنصورة",
      "باب مارع",
      "بعلول",
      "تل ذنوب",
      "جب جنين",
      "حوش الحريمة",
      "خربة قنافار",
      "زلايا",
      "سحمر",
      "صغبين",
      "عانا",
      "عميق",
      "عيتنيت",
      "عين التينه",
      "عين زبده",
      "غزه",
      "قليا",
      "كامد اللوز",
      "كفريا",
      "لالا",
      "لبايا",
      "لوسيا",
      "مشغره",
      "ميدون",
      "يحمر",
    ],

    "قضاء راشيا": [
      "البيره",
      "الحوش",
      "الرفيد",
      "العقبة",
      "المحيدثة",
      "بكا",
      "بكيفا",
      "بيت لهيا",
      "تنوره",
      "حلوة",
      "خربة روحا",
      "دير العشاير",
      "راشيا",
      "سلساتا",
      "ضهر الاحمر",
      "عيتا الفخار",
      "عيحا",
      "عين حرشه",
      "عين عرب",
      "عين عطا",
      "كفردنيس",
      "كفرقوق",
      "كفرمشكي",
      "كوكبا",
      "مجدل بلهيص",
      "مدوخا",
      "ينطا",
    ],

    "قضاء عكار": [
      "اكروم",
      "البرج",
      "البساتين",
      "البقيعه",
      "البيره",
      "التليل",
      "الجديدة",
      "الحميرة",
      "الحوشب",
      "الحويش",
      "الحيصا",
      "الدبابية",
      "الدغلة",
      "الدوره",
      "الدوسه",
      "الرامه",
      "الريحانية",
      "الزواريب",
      "السماقية",
      "السنديانة",
      "السهله",
      "السويسة",
      "الشقدوف",
      "الشيخ زناد",
      "الشيخ طابا",
      "الشيخ عياش",
      "الشيخ محمد",
      "العبده",
      "العبودية",
      "العريضة",
      "العماير",
      "العواده",
      "العوينات",
      "العيون",
      "الغزيله",
      "الفرض",
      "القبيات",
      "القرقف",
      "القرنة",
      "القريات",
      "القليعات",
      "القنطرة",
      "الكنيسة",
      "الكواشره",
      "الكويخات",
      "المجدل",
      "المحمرة",
      "المسعودية",
      "المقيبلة",
      "المقيطع",
      "المونسه",
      "النفيسة",
      "النهريه وبستان الحرش",
      "النوره",
      "الهد",
      "الهيشه",
      "ايلات",
      "ببنين",
      "برباره",
      "برج العرب",
      "برقايل",
      "بزال",
      "بزبينا",
      "بقرزلا",
      "بني صخر",
      "بيت الحاج",
      "بيت الحوش",
      "بيت ايوب",
      "بيت غطاس",
      "بيت ملات",
      "بيت يونس",
      "بينو",
      "تاشع",
      "تكريت",
      "تلبيبة",
      "تلبيرة",
      "تلة وشطاحه",
      "تلحميرة",
      "تلعباس شرقي",
      "تلعباس غربي",
      "تلمعيان",
      "جبرائيل",
      "جبل المنصوره",
      "جديدة القيطع",
      "جرمنايا",
      "حبشيت",
      "حرار",
      "حكر الشيخ طابا",
      "حكر الضاهري",
      "حلبا",
      "حنيدر",
      "حيزوق",
      "خربة الجرد",
      "خربة داوود",
      "خربة شار",
      "خريبة الجندي",
      "خط البترول",
      "دارين",
      "دوير عدويه",
      "دير جنين",
      "دير دلوم",
      "ذوق الحبالصة",
      "ذوق الحصنية",
      "ذوق المقشرين",
      "ذوق حدارة",
      "رجم عيسى",
      "رحبة",
      "رماح",
      "سرار",
      "سعدين",
      "سفينة الدريب",
      "سفينة القيطع",
      "سيسوق",
      "شان",
      "شدره",
      "شربيلا",
      "شيخلار",
      "ضهر القنبر",
      "ظهر الليسينة",
      "عدبل",
      "عرقا",
      "عكار العتيقة",
      "عمار البيكات",
      "عماره",
      "عندقت",
      "عيات",
      "عيدمون",
      "عين الذهب",
      "عين الزيت",
      "عين تنتا",
      "عين يعقوب",
      "عيون الغزلان",
      "فريديس",
      "فنيدق",
      "قبة شمرا",
      "قبعيت",
      "قبولا",
      "قرحه",
      "قشلق",
      "قلود الباقية",
      "قنية",
      "كرم زبدين",
      "كرم عصفور",
      "كروم عرب",
      "كفر الفتوح",
      "كفرتون",
      "كفرحره",
      "كفرنون",
      "كوشا",
      "مار توما",
      "مجدلا",
      "مراح الخوخ",
      "مزرعة بلدة",
      "مشتى حسن",
      "مشتى حمود",
      "مشحة",
      "مشمش",
      "مشيلحة الحاكور",
      "ممنع",
      "منجز",
      "منيارة",
      "هيتلا",
      "وادي الجاموس",
      "وادي الحور",
      "وادي خالد",
    ],

    "قضاء طرابلس": [
      "التبانة",
      "التل",
      "الحدادين",
      "الحديد",
      "الرمانة",
      "الزهرية",
      "السويقة",
      "القبة",
      "القلمون",
      "المهاتره",
      "الميناء",
      "النوري",
    ],

    "قضاء زغرتا": [
      "اجبع",
      "ارده",
      "اسلوت",
      "اصنون",
      "البحيره",
      "القادريه",
      "ايطو",
      "ايعال",
      "بسلوقيط",
      "بشنين",
      "بنشعي",
      "بوسيط",
      "بيت عبيد",
      "بيت عوكر",
      "تولا الجبه",
      "حارة الفوار",
      "حرف ارده",
      "حرف مزياره",
      "حريقص",
      "حميص",
      "حيلان",
      "داريا",
      "راسكيفا",
      "رشعين",
      "زغرتا",
      "سبعل",
      "سرعل",
      "عربة قزحيا",
      "عرجس",
      "عشاش",
      "علما",
      "عينطورين",
      "قره باش",
      "كرم سده",
      "كفرحاتا",
      "كفرحورا",
      "كفردلاقوس",
      "كفرزينا",
      "كفرشخنا",
      "كفرصغاب",
      "كفرفو",
      "كفريا",
      "كفرياشيت",
      "مجدليا",
      "مرياطه",
      "مزرعة التفاح",
      "مزرعة الفريديس",
      "مزرعة النهر",
      "مزرعة حوقا",
      "مزيارة",
    ],

    "قضاء بشري": [
      "الديمان",
      "المغر وبلا",
      "بان",
      "برحليون",
      "بريسات",
      "بزعون",
      "بشري",
      "بقاعكفرا",
      "بقرقاشا",
      "بلوزا",
      "بيت منذر",
      "حدث الجبة",
      "حدشيت",
      "حصرون",
      "طورزا",
      "عبدين",
      "قنات",
      "قنيور",
      "مزرعة بني صعب",
      "مزرعة عساف",
      "وادي قنوبين",
    ],

    "قضاء البترون": [
      "آسيا",
      "اجدبرا",
      "اده",
      "البترون",
      "الدوق",
      "العلالي",
      "الفتاحات وهربونا",
      "المسرح والبقعية",
      "الهري",
      "بجدرفل",
      "بشتودار",
      "بشعله",
      "بقسميا",
      "بيت شلالا",
      "تحوم",
      "تنورين التحتا",
      "تنورين الفوقا",
      "تولا",
      "جبلا",
      "جران",
      "جربتا",
      "حامات",
      "حدتون",
      "حردين",
      "حلتا",
      "داعل",
      "دريا",
      "دوما",
      "دير بلا",
      "راس نحاش",
      "راشا",
      "راشانا",
      "راشكيدا",
      "رام",
      "رشكده",
      "زان",
      "سلعاتا",
      "سمار جبيل",
      "شاتين",
      "شبطين",
      "شكا",
      "صغار",
      "صورات",
      "ضهر ابو ياغي",
      "عبدللي",
      "عبرين",
      "عرطز",
      "عوره",
      "غوما",
      "قندولا",
      "كفرحتنا",
      "كفرحلدا",
      "كفرحي",
      "كفرشليمان",
      "كفرعبيدا",
      "كفور العربي",
      "كفيفان",
      "كوبا",
      "كور",
      "مار ماما",
      "محمرش",
      "مراح الحاج",
      "مراح الزيات",
      "مراح شديد",
      "نحلا",
      "نيحا",
      "وجه الحجر",
      "وطى حوب",
    ],

    "قضاء الكورة": [
      "اجدعبرين",
      "البحصاص",
      "المجدل",
      "النخلة",
      "اميون",
      "انفه",
      "بترومين",
      "بتعبورة",
      "بتوراتيج",
      "بحبوش",
      "بدبا",
      "بدبهون",
      "بدنايل",
      "برسا",
      "برغون",
      "بزيزا",
      "بشمزين",
      "بصرما",
      "بطرام",
      "بكفتين",
      "بنهران",
      "حارة الخاصة",
      "دار بعشتار",
      "دار شمزين",
      "دده",
      "راس مسقا الجنوبية",
      "راس مسقا الشمالية",
      "رشدبين",
      "زغرتا المتاولة",
      "زكرون",
      "ضهر العين",
      "ضهور الهوا",
      "عابا",
      "عفصديق",
      "عين عكرين",
      "فيع",
      "قلحات",
      "كفتون",
      "كفرحاتا",
      "كفرحزير",
      "كفرصارون",
      "كفرعقا",
      "كفرقاهل",
      "كفريا",
      "كوسبا",
      "متريت",
    ],
    "قضاء المنية-الضنية": [
      "البداوي",
      "الحازمية",
      "الخرنوب",
      "الروضه",
      "الريحانية",
      "السفيرة",
      "القرين",
      "القطين",
      "القمامين",
      "المطل",
      "المنيه",
      "النبي يوشع",
      "ايزال",
      "بحنين",
      "بحويتا",
      "بخعون",
      "برج اليهودية",
      "بطرماز",
      "بقاعصفرين",
      "بقرصونا",
      "بيت الفقس",
      "بيت حاويك",
      "تربل",
      "حرف سياد",
      "حقل العزيمة",
      "حواره",
      "دبعل",
      "دير عمار",
      "دير نبوح",
      "زغرتغرين",
      "سير",
      "طاران",
      "عاصون",
      "عزقي",
      "عيمار",
      "عين التينه",
      "قرحيا",
      "قرصيتا",
      "كرم المهر",
      "كفربنين",
      "كفرحبو",
      "كفرشلان",
      "كهف الملول",
      "مراح السراج",
      "مراح السفيره",
      "مركبتا",
      "نمرين",
      "وادي النحله",
    ],
    "قضاء صيدا": [
      "البرامية",
      "البيساريه",
      "الحارة",
      "الحجة",
      "الخرايب",
      "الزرارية",
      "السكسكية",
      "الصالحية",
      "الصرفند",
      "العدوسيه",
      "الغازية",
      "الغسانيه",
      "القرية",
      "القنيطرة",
      "اللوبيه",
      "المروانية",
      "المعمرية",
      "المية ومية",
      "النجارية",
      "الهلالية",
      "انصارية",
      "برتي",
      "بقسطه",
      "بنعفول",
      "تفاحتا",
      "جنجلايا",
      "خرطوم",
      "خزيز",
      "درب السيم",
      "زغدرايا",
      "زيتا",
      "طبايا",
      "طنبوريت",
      "عبرا",
      "عدلون",
      "عرب الجل",
      "عقتانيت",
      "عنقون",
      "عين الدلب",
      "قاقعية الصنوبر",
      "قناريت",
      "كفربيت",
      "كفرحتى",
      "كفرشلال",
      "كفرملكي",
      "كفريا",
      "كوثرية السياد",
      "مجدليون",
      "مغدوشة",
    ],
    "قضاء صور": [
      "ارزون",
      "البازورية",
      "البرغلية",
      "البساتين",
      "البستان",
      "البص",
      "البياض",
      "الجبين",
      "الحلوسية",
      "الحميري",
      "الحنيه",
      "الرشيديه",
      "الرمادية",
      "الزلوطيه",
      "السماعية",
      "الشعيتية",
      "الشهابيه",
      "الظهيرة",
      "العباسيه",
      "القليلة",
      "الكنيسة",
      "المالكيه",
      "المجادل",
      "المنصوري",
      "الناقورة",
      "النفاخية",
      "باتوليه",
      "باريش",
      "بافليه",
      "بدياس",
      "برج الشمالي",
      "برج رحال",
      "بستيات",
      "جبال البطم",
      "جناتا",
      "جويا",
      "حنوية",
      "دبعال",
      "دردغيا",
      "دير عامص",
      "دير قانون النهر",
      "دير قانون رأس العين",
      "دير كيفا",
      "رشكنانية",
      "زبقين",
      "سلعا",
      "شبريحا",
      "شحور",
      "شمع",
      "شيحين",
      "صديقين",
      "صريفا",
      "صور",
      "طورا",
      "طير حرفا",
      "طير دبا",
      "طير فلسيه",
      "علما الشعب",
      "عيتيت",
      "عين ابو عبد الله",
      "عين الزرقا",
      "عين بعال",
      "قانا",
      "مجدلزون",
      "محرونه",
      "مروحين",
      "مزرعة مشرف",
      "معركة",
      "معروب",
      "وادي جيلو",
      "يارين",
      "يانوح",
    ],
    "قضاء جزين": [
      "الجرمق",
      "الحرف",
      "الحسانيه",
      "الحمصيه",
      "الريحان",
      "السريرة",
      "العيشيه",
      "الغباطية",
      "القطراني",
      "اللويزه",
      "المجيدل",
      "المحاربيه",
      "المكنونية",
      "الميدان",
      "انان",
      "بتدين اللقش",
      "بحنين وكفرتعلا",
      "بسري",
      "بصليا",
      "بكاسين",
      "بنواتي",
      "بيصور",
      "تعيد",
      "جرنايا",
      "جزين",
      "جنسنايا",
      "حيتولي ووادي الليمون",
      "حيطورة",
      "روم",
      "ريمات وشقاديف",
      "زحلتا",
      "سجد",
      "سنيا",
      "شواليق",
      "صبّاح",
      "صفارية",
      "صيدون",
      "عاراي",
      "عازور",
      "عرمتى",
      "عين المير",
      "عين مجدلين",
      "قتالي",
      "قطين وحيداب",
      "قيتولي",
      "كرخا",
      "كفرجرة",
      "كفرحونة",
      "كفرفالوس",
      "لبعه",
      "مراح الحباس",
      "مزرعة المطحنة",
      "مشموشة",
      "مليخ",
      "وادي بعنقودين",
      "وادي جزين",
    ],
    "قضاء النبطية": [
      "ارنون",
      "الدوير",
      "الشرقية",
      "القصيبة",
      "الكفور",
      "النبطية",
      "النبطية الفوقا",
      "النميرية",
      "انصار",
      "بريقع",
      "تول",
      "جباع",
      "جبشيت",
      "جرجوع",
      "حاروف",
      "حبوش",
      "حومين التحتا",
      "حومين الفوقا",
      "دير الزهراني",
      "رومين",
      "زبدين",
      "زفتا",
      "زوطر الشرقية",
      "زوطر الغربية",
      "سيني",
      "شوكين",
      "صربا",
      "صير الغربية",
      "عبا",
      "عدشيت",
      "عربصاليم",
      "عزه",
      "عين بوسوار",
      "عين قانا",
      "قاقعية الجسر",
      "كفرتبنيت",
      "كفررمان",
      "كفرصير",
      "كفرفيلا",
      "كفروه",
      "ميفدون",
      "يحمر",
    ],
    "قضاء حاصبيا": [
      "ابو قمحة",
      "الخلوات",
      "الدلافه",
      "الفرديس",
      "الكفير",
      "الماري",
      "المجيدية",
      "الهبارية",
      "برغز",
      "حاصبيا",
      "راشيا الفخار",
      "شبعا",
      "شويا",
      "عين جرفا",
      "عين قنيا",
      "كفر حمام",
      "كفرشوبا",
      "كوكبا",
      "مرج الزهور",
      "ميمس",
    ],
    "قضاء مرجعيون": [
      "ابل السقي",
      "البويضة",
      "الجديدة",
      "الخيام",
      "الصوانة",
      "الطيبة",
      "القصير",
      "القليعة",
      "القنطرة",
      "الوزاني",
      "برج الملوك",
      "بلاط",
      "بليدا",
      "بني حيان",
      "تولين",
      "حولا",
      "دبين",
      "دير سريان",
      "دير ميماس",
      "ربثلاثين",
      "سردا والعمرا",
      "طلوسه",
      "عدشيت",
      "عديسة",
      "علمان",
      "عين عرب",
      "قبريخا",
      "كفركلا",
      "مجدل سلم",
      "محيبيب",
      "مركبا",
      "ميس الجبل",
    ],
    "قضاء بنت جبيل": [
      "الجميجمه",
      "السلطانيه",
      "الطيري",
      "الغندوريه",
      "القوزح",
      "برج قلاويه",
      "برعشيت",
      "بنت جبيل",
      "بيت ليف",
      "بيت ياحون",
      "تبنين",
      "حاريص",
      "حانين",
      "حداثا",
      "خربة سلم",
      "دبل",
      "دير انطار",
      "راميه",
      "رشاف",
      "رميش",
      "شقرا",
      "صربين",
      "صفد البطيخ",
      "عيتا الجبل",
      "عيتا الشعب",
      "عيترون",
      "عين ابل",
      "عيناتا",
      "فرون",
      "قلاويه",
      "كفرا",
      "كفردونين",
      "كونين",
      "مارون الراس",
      "يارون",
      "ياطر",
    ],
  };

  useEffect(() => {
    // When district changes, update the regions dropdown
    if (formData.district) {
      setRegions(districtRegionsMap[formData.district] || []);
      // Reset the region when district changes
      setFormData((prev) => ({ ...prev, region: "" }));
    } else {
      setRegions([]);
    }
  }, [formData.district]);

  // Handle form input changes
  const handleChange = (e) => {
    const { name, value } = e.target;
    setFormData({ ...formData, [name]: value });
  };

  // Validate email format
  const validateEmail = (email) => {
    const regex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
    return regex.test(email);
  };

  // Handle form submission
  const handleSubmit = async (e) => {
    e.preventDefault();
    setLoading(true);

    // Frontend validation
    if (Object.values(formData).some((value) => value.trim() === "")) {
      toast.error("جميع الحقول مطلوبة");
      setLoading(false);
      return;
    }

    if (!validateEmail(formData.email)) {
      toast.error("البريد الإلكتروني غير صالح");
      setLoading(false);
      return;
    }

    // Validate booking data if phone call is selected
    if (formData.contact === "اتصال هاتفي" && (!bookingDate || !bookingTime)) {
      toast.error("يرجى اختيار موعد للاتصال");
      setLoading(false);
      return;
    }

    try {
      const response = await fetch(
        `${import.meta.env.VITE_REACT_APP_API_URL}/users/auth/register`,
        {
          method: "POST",
          headers: { "Content-Type": "application/json" },
          body: JSON.stringify({
            ...formData,
            sessionDate:
              formData.contact === "اتصال هاتفي" ? bookingDate : null,
            sessionTime:
              formData.contact === "اتصال هاتفي" ? bookingTime + ":00" : null,
            //status: formData.contact === "اتصال هاتفي" ? false : null,
          }),
        }
      );

      const data = await response.json();

      if (!response.ok) throw new Error(data.error || "حدث خطأ أثناء التسجيل");

      toast.success(
        data.message || "تم التسجيل بنجاح! يرجى التحقق من البريد  الإلكتروني"
      );
      setRegistered(true);

      setFormData({
        // Reset form
        name: "",
        phone: "",
        email: "",
        district: "",
        region: "",
        role: "",
        password: "",
        contact: "",
      });

      // Also reset booking data
      setBookingDate(null);
      setBookingTime(null);
      setShowBookingModal(false);
    } catch (error) {
      toast.error(error.message);
    } finally {
      setLoading(false);
    }
  };

  if (registered) {
    return (
      <div className="verification-msg-wraper">
        {" "}
        <div className="verification-message" dir="rtl">
          <h2>تم التسجيل بنجاح!</h2>
          <p>
            لقد أرسلنا رسالة تأكيد إلى بريدك/ي الإلكتروني. يرجى التحقق من
            بريدك/ي الإلكتروني وانقر/ي على الرابط الموجود في الرسالة لتفعيل
            حسابك/ي .
          </p>
          <p>
            لم تصل الرسالة؟ تحقق من مجلد البريد العشوائي أو{" "}
            <button
              onClick={() => navigate("/resend-verification")}
              className="resend-btn"
            >
              إعادة إرسال رسالة التأكيد
            </button>
          </p>
          <button onClick={() => navigate("/login")} className="login-btn">
            الذهاب إلى صفحة تسجيل الدخول
          </button>
        </div>
      </div>
    );
  }

  return (
    <div className="register-container container my-5">
      <h1 className="register-heading">انضموا إلينا</h1>
      <form onSubmit={handleSubmit} className="register-form">
        {/* Full Name */}
        <div className="register-input-group mb-4">
          <label htmlFor="name" className="register-label">
            <User className="icon" size={20} color="#202d61" />
            الاسم الكامل
          </label>
          <input
            type="text"
            id="name"
            name="name"
            value={formData.name}
            onChange={handleChange}
            placeholder="الاسم الكامل"
            className="register-input form-input"
          />
        </div>

        {/* Phone */}
        <div className="register-input-group mb-4">
          <label htmlFor="phone" className="register-label">
            <Phone className="icon" size={20} color="#202d61" />
            الهاتف
          </label>
          <input
            id="phone"
            name="phone"
            value={formData.phone}
            onChange={handleChange}
            placeholder=" الهاتف"
            className="register-input form-input"
          />
        </div>

        {/* Email */}
        <div className="register-input-group mb-4">
          <label htmlFor="email" className="register-label">
            <Mail className="icon" size={20} color="#202d61" />
            البريد الإلكتروني
          </label>
          <input
            type="email"
            id="email"
            name="email"
            value={formData.email}
            onChange={handleChange}
            placeholder="البريد الإلكتروني"
            className="register-input form-input"
          />
        </div>

        {/* District Dropdown */}
        <div className="register-input-group mb-4">
          <label htmlFor="district" className="register-label">
            <MapPin className="icon" size={20} color="#202d61" />
            القضاء
          </label>
          <select
            id="district"
            name="district"
            value={formData.district}
            onChange={handleChange}
            className="register-select form-input"
          >
            <option value="" disabled>
              اختر/ي القضاء
            </option>
            {districts.map((district, index) => (
              <option key={index} value={district}>
                {district}
              </option>
            ))}
          </select>
        </div>

        {/* Region Dropdown - Only show when a district is selected */}
        {formData.district && (
          <div className="register-input-group mb-4">
            <label htmlFor="region" className="register-label">
              <MapPin className="icon" size={20} color="#202d61" />
              المنطقة
            </label>
            <select
              id="region"
              name="region"
              value={formData.region}
              onChange={handleChange}
              className="register-select form-input"
            >
              <option value="" disabled>
                اختر/ي المنطقة
              </option>
              {regions.map((region, index) => (
                <option key={index} value={region}>
                  {region}
                </option>
              ))}
            </select>
          </div>
        )}

        {/* Role Dropdown */}
        <div className="register-input-group mb-4">
          <label htmlFor="role" className="register-label">
            <UserCheck className="icon" size={20} color="#202d61" />
            هل أنت/ي :
          </label>
          <select
            id="role"
            name="role"
            value={formData.role}
            onChange={handleChange}
            className="register-select form-input"
          >
            <option value="" disabled>
              هل أنت/ي :
            </option>
            {roles.map((role, index) => (
              <option key={index} value={role}>
                {role}
              </option>
            ))}
          </select>
        </div>

        {/* Password */}
        <div className="register-input-group mb-4">
          <label htmlFor="register-password" className="register-label">
            <Lock className="icon" size={20} color="#202d61" />
            كلمة المرور
          </label>
          <input
            type="password"
            id="register-password"
            name="password"
            value={formData.password}
            onChange={handleChange}
            placeholder="كلمة المرور"
            className="register-input form-input"
          />
        </div>

        {/* way of contact */}
        <div className="register-input-group mb-4">
          <label htmlFor="contact" className="register-label">
            <MessageCircleMore className="icon" size={20} color="#202d61" />
            كيف تريدون ان يتم التواصل معكم؟
          </label>
          <select
            id="contact"
            name="contact"
            value={formData.contact}
            onChange={handleChange}
            className="register-select form-input way-of-contact"
          >
            <option value="" disabled>
              كيف تريدون ان يتم التواصل معكم؟
            </option>
            {contacts.map((contact, index) => (
              <option key={index} value={contact}>
                {contact}
              </option>
            ))}
          </select>
        </div>
        {/* Show the booking button only when phone call is selected */}
        {formData.contact === "اتصال هاتفي" && (
          <div className="booking-selector mb-3">
            <button
              type="button"
              className="booking-button"
              onClick={() => setShowBookingModal(true)}
            >
              <Calendar size={20} />
              {bookingDate && bookingTime
                ? `الموعد المحدد: ${bookingDate} - ${bookingTime}`
                : "اختر موعدًا للاتصال"}
            </button>
          </div>
        )}
        {/* Submit Button */}
        <button
          type="submit"
          className="register-submit-button submit-btn"
          disabled={loading}
        >
          {loading ? (
            <div className="register-spinner"></div>
          ) : (
            <>
              <KeyRound className="icon" size={20} color="#FFFFFF" />
              تسجيل
            </>
          )}
        </button>

        {/* Legal Statement */}
        <p className="register-legal">
          لن نشارك معلوماتكم مع أطراف ثالثة. سيتم استخدام بياناتكم وفقًا لسياسة
          الخصوصية الخاصة بنا.
        </p>
      </form>
      {showBookingModal && (
        <div className="register-modal-overlay">
          <div className="register-modal-content">
            <button
              className="register-modal-close"
              onClick={() => setShowBookingModal(false)}
            >
              &times;
            </button>
            <BookingCalendar
              onSelectDateTime={(date, time) => {
                setBookingDate(dayjs(date).format("YYYY-MM-DD"));
                setBookingTime(time);
                setShowBookingModal(false);
              }}
            />
          </div>
        </div>
      )}
    </div>
  );
};

export default Register;
